{
    "education_entries": [
        {
            "type": "degree",
            "title": "Masterafhandling",    
            "title_thesis": "Integration af HeRSCheL-subdetektoren i LHCb's TDAQ-bane",
            "grade": "1.0",
            "entity": "LHCb collaboration @ CERN",
            "entity_group": "HeRSCheL subdetector",
            "entity_url": "https://lhcb.web.cern.ch/",
            "entity_image": "entity_images/lhcb.png",
            "place": "Genève, Schweiz",
            "start": "04/2015",
            "end": "05/2016",
            "background": [
                "Large Hadron Collider (LHC) er en cirkulær partikelaccelerator, der er placeret ved CERN i Genève. Protoner accelereres til ", 
                "bringes til frontalinteraktion med hinanden i et af eksperimenterne. Hvert eksperiment ",
                "består af flere underdetektorer, der er ansvarlige for forskellige opgaver, f.eks. energimåling eller partikelsporing. ",
                "I vekselvirkningspunktet (IP) omdannes en del af den energi, der er indeholdt i de accelererede protoner, til flere ",
                "sekundære partikler, som derefter måles af subdetektorerne. Det afhænger af de interagerende protoners baner ",
                "i hvilken retning den sekundære partikelregn peger. Subdetektorerne i LHCb-eksperimentet er konstrueret således, at de ",
                "kan måle partikler, hvis baner har en relativt lille vinkel i forhold til den primære protonstråle. ",
                "High Rapidity Shower Counter for LHCb (HeRSCheL) er blevet designet som en tilføjelse til LHCb med det formål ",
                "at udvide dækningen til endnu mindre vinkler. HeRSCheL består af stationer langs strålerøret op til ±114 m fra IP. ",
                "Hver station består af fire scintillerende paddetektorer, hvis lysudgang stimulerer et fotomultiplikatorrør. ",
                "Stationerne er grupperet i to sider: fremad og bagud, afhængigt af deres relative position i forhold til IP.",
                "Interaktioner ved LHC sker hver 25ns eller med 40 MHz. Hver interaktion kan potentielt skabe en datapakke med ",
                "størrelsen på omkring 100 Kilobyte, der indeholder målingerne fra alle underdetektorer. Da den akkumulerede datahastighed på 4 ",
                "terabyte pr. sekund er for stor til at blive behandlet i realtid, analyserer en filtreringsmekanisme nogle af subdetektorerne ",
                "data. Hvis den genkender en interessant begivenhed for partikelfysikken, udløser den udlæsning af data, som midlertidigt ",
                "gemt i hver enkelt subdetektor. Denne lagring er normalt realiseret som en FIFO integreret i en FPGA. ",
                "HeRSCheL genbruger komponenter fra andre LHCb-subdetektorer for at holde udviklingstiden og omkostningerne nede. Imidlertid, ",
                "disse komponenter er ikke designet til store afstande mellem subdetektorkomponenterne."
            ],
            "content": [
                "Frontend-elektroniksoftware: VHDL-koden for udløser-FPGA'en blev ændret, så udløserdataene fra alle HeRSCheL-stationer er tidsjusteret.",
                "Frontend-elektronikhardware: tre kort blev integreret i LHCb-eksperimentalsystemet. To kontrolkort på HeRSCHeL-stationerne og et valgkort i LHCb-elektroniksystemet",
                "Eksperimentelt kontrolsystem: nye SCADA-operatørpaneler til HeRSCheL blev programmeret og integreret i LHCb-rammen."
            ]        },
        {
            "type": "studies",
            "title": "Masterstudier",
            "title_studies": "Elektroteknik og datateknik",
            "title_academic": "Master of Science (M.Eng.)",
            "grade": "A",
            "entity": "Ryerson University",
            "entity_group": "Yeates School of Graduate Studies",
            "entity_url": "https://www.ryerson.ca/graduate/programs/electrical-computer-engineering/",
            "entity_image": "entity_images/ryerson.png",
            "place": "Toronto, Canada",
            "start": "2015",
            "end": "2016",
            "contents": [
                "Optiske kommunikationsnetværk",
                "Anvendte optimeringsteknikker",
                "Modellering af computersystemer",
                "Trådløs kommunikation",
                "Intelligente systemer",
                "Arkitektur af FPGA'er"
            ]
        },
        {
            "type": "studies",
            "title": "Masterstudier",
            "title_studies": "Elektroteknik",
            "title_academic": "Master of Science (M.Sc.)",
            "grade": "1.9",
            "entity": "Hochschule Karlsruhe",
            "entity_group": "Faculty EIT",
            "entity_url": "https://www.hs-karlsruhe.de/master-eit/",
            "entity_image": "entity_images/hska.png",
            "place": "Karlsruhe, Tyskland",
            "start": "2013",
            "end": "2016",
            "contents": [
                "Signalteori",
                "Sikkerhed og sikring i automatisering",
                "Informationsteori og kodning",
                "Analog-digitale systemer",
                "RF-systemer",
                "Design for Six Sigma",
                "Industriel kontrolinformatik"
            ]
        },
        {
            "type": "degree",
            "title": "Bacheloropgave",    
            "title_thesis": "Sammenligning af ukonventionelle optiske filtre til diskrimination af materialer i NIR",
            "grade": "1.3",
            "entity": "Fraunhofer IOSB",
            "entity_group": "Afdeling for visuelle inspektioner",
            "entity_url": "https://www.iosb.fraunhofer.de/",
            "entity_image": "entity_images/fhg_logo.png",
            "place": "Karlsruhe, Tyskland",
            "start": "06/2012",
            "end": "09/2012",

            "background": [
                "I mange industrier, f.eks. inden for fødevareforarbejdning, anvendes automatiserede optiske måleteknikker ",
                "anvendes til at sikre et produkts kvalitet. Ud over den synlige del af det elektromagnetiske bølgespektrum ",
                "er også den nærinfrarøde del mellem 800-2500 nm af betydning, fordi mange organiske molekyler ophidses, hvilket ",
                "hvilket igen fører til en absorption eller transmission af en bestemt bølgelængde. Ved hjælp af disse spektrer kan uønsket materiale ",
                " (f.eks. snavs) adskilles fra det ønskede produkt. Men de høje transporthastigheder i industrien ",
                "forhindrer brugen af billedspektrometre, der har en maksimal billedhastighed på ca. 300 Hz. For eksempel ved en almindelig transporthastighed ",
                "på 3 meter i sekundet vil kun hver centimeter af det transporterede gods blive analyseret. Det er for lidt til små materialer",
                "som f.eks. kaffe. Linjekameraer kan derimod have høje billedfrekvenser på op til 20 kHz, er enkelt opbygget og billigere.",
                "Et linjekamera, hvis detektorchips er baseret på silikone, er følsomme over for bølgelængder fra 200-1000nm. Almindelige er kameraer ",
                "der har flere kanaler og derfor filtre for en bestemt farve (f.eks. rød, grøn og blå). ",
                "I stedet for at bruge et konventionelt, Gauss-formet optisk filter med transmissionsspektrum kan man bruge ikke-konventionelle optiske filtre",
                "med et andet transmissionsspektrum. Dette transmissionsspektrum vil være baseret på det materiale, der skal detekteres, og kan konstrueres ",
                "ved hjælp af maskinlæring og klassifikationsprocedurer."
            ],
            "content": [
                "Konstruktion og automatisering af en optisk bænk til indsamling af spektrale data fra forskellige organiske materialer",
                "Tilslutning og automatisering af et NIR-spektrometer til MATLAB-analyse af de organiske materialer",
                "Grænseflader og automatisering af en spektralt programmerbar NIR-lyskilde",
                "Klassificering af organiske materialer på grundlag af indsamlede data og ved hjælp af NIR-lyskilden".
            ]
        },      
        {
            "type": "studies",
            "title": "Semester i udlandet",
            "title_studies": "Elektroteknik og telekommunikationsteknik",
            "title_academic": "",
            "grade": "",
            "entity": "Universitatea Politehnica",
            "entity_group": "Fakultetet for elektronik og telekommunikationsteknik",
            "entity_url": "http://www.upt.ro/international/index.php?id=&lb=en",
            "entity_image": "entity_images/upt.jpg",
            "place": "Timisoara, Rumænien",
            "start": "2012",
            "end": "2013",
            "contents": [
                "Digital signalbehandling",
                "LabView Automation",
                "Trådløs kommunikation"              
            ]
        },
        {
            "type": "studies",
            "title": "Bachelor-studier",
            "title_studies": "Elektroteknik",
            "title_academic": "Bachelor of Engineering (B.Eng.)",
            "grade": "1.9",
            "entity": "Hochschule Karlsruhe",
            "entity_group": "Faculty EIT",
            "entity_url": "https://www.hs-karlsruhe.de/en/prospective-students/regular-degree-programs/bachelor/",
            "entity_image": "entity_images/hska.png",
            "place": "Karlsruhe, Tyskland",
            "start": "2009",
            "end": "2013",
            "contents": [
                "Elektriske felter",
                "Kontrolteori",
                "Elektronik",
                "informationsteori",
                "Stokastiske signaler og systemer",
                "RF-teknikker",
                "Design af analoge og digitale systemer",
                "Mobile kommunikationssystemer",
                "Målingsteknikker"
            ]
        }        
    ]
}
