{
    "education_entries": [
        {
            "type": "degree",
            "title": "Master's thesis",    
            "title_thesis": "Integration of the HeRSCheL Subdetector into the TDAQ path of LHCb",
            "grade": "1.0",
            "entity": "LHCb collaboration @ CERN",
            "entity_group": "HeRSCheL subdetector",
            "entity_url": "https://lhcb.web.cern.ch/",
            "entity_image": "entity_images/lhcb.png",
            "place": "Geneva, Switzerland",
            "start": "04/2015",
            "end": "05/2016",
            "background": [
                "The Large Hadron Collider (LHC) is a circular particle accelerator based at CERN, Geneva. Protons are accelerated to ", 
                "be brought to heads-on interaction with each other in one of the experiments. Each experiment ",
                "consists of several subdetectors responsible for different tasks, for example energy measurement or particle tracking. ",
                "At the interaction point (IP), a part of the energy contained in the accelerated protons is converted into multiple ",
                "secondary particles, which are then measured by the subdetectors. It depends on the trajectories of the interacting protons ",
                "in which direction the secondary particle shower points. The subdetectors of the LHCb experiment are designed so that they ",
                "can measure particles whose trajectories have a relatively small angle to the primary proton beam. ",
                "The High Rapidity Shower Counter for LHCb (HeRSCheL) has been designed as an add on to LHCb with the purpose ",
                "to extend the coverage to even smaller angles. HeRSCheL consists of stations along the beam pipe up to ±114m away from the IP. ",
                "Each station consists of four scintillating pad detectors, whose light output stimulates a photomultiplier tube. ",
                "The stations are grouped into two sides: forward and backward, depending on their relative position to the IP.",
                "Interactions at the LHC happen every 25ns or at 40MHz. Each interaction could potentially create a data package with ",
                "the size of about 100 Kilobyte, containing the measurements of all subdetectors. Since the accumulated data rate of 4 ",
                "Terabyte per second is too high to be processed at real time, a filtering mechanism analyzes some of the subdetector ",
                "data. If it recognizes an interesting event for particle physics, it triggers the read out of data, which was temporarily ",
                "stored at each subdetector. This storage is usually realized as a FIFO integrated into an FPGA. ",
                "HeRSCheL is reusing components from other LHCb subdetectors to keep development time and costs low. However, ",
                "these components have not been designed for high distances between subdetector components."
            ],
            "content": [
                "Frontend electronics software: the VHDL code of the trigger FPGA was modified so the trigger data of all HeRSCheL stations is time-aligned.",
                "Frontend electronics hardware: three boards were integrated into the LHCb experimental system. Two control boards at the HeRSCHeL stations and one selection board inside the LHCb electronics system",
                "Experimental control system: new SCADA operator panels for HeRSCheL were programmed and integrated into the LHCb framework."
            ]        },
        {
            "type": "studies",
            "title": "Master studies",
            "title_studies": "Electrical and Computer Engineering",
            "title_academic": "Master of Science (M.Eng.)",
            "grade": "A",
            "entity": "Ryerson University",
            "entity_group": "Yeates School of Graduate Studies",
            "entity_url": "https://www.ryerson.ca/graduate/programs/electrical-computer-engineering/",
            "entity_image": "entity_images/ryerson.png",
            "place": "Toronto, Canada",
            "start": "2015",
            "end": "2016",
            "contents": [
                "Optical Communication Networks",
                "Applied Optimization Techniques",
                "Computer Systems Modelling",
                "Wireless Communications",
                "Intelligent Systems",
                "Architecture of FPGAs"
            ]
        },
        {
            "type": "studies",
            "title": "Master studies",
            "title_studies": "Electrical Engineering",
            "title_academic": "Master of Science (M.Sc.)",
            "grade": "1.9",
            "entity": "Hochschule Karlsruhe",
            "entity_group": "Faculty EIT",
            "entity_url": "https://www.hs-karlsruhe.de/master-eit/",
            "entity_image": "entity_images/hska.png",
            "place": "Karlsruhe, Germany",
            "start": "2013",
            "end": "2016",
            "contents": [
                "Signal Theory",
                "Safety and Security in Automation",
                "Information Theory and Coding",
                "Analog-digital Systems",
                "RF Systems",
                "Design for Six Sigma",
                "Industrial Control Informatics"
            ]
        },
        {
            "type": "degree",
            "title": "Bachelor's thesis",    
            "title_thesis": "Comparison of unconventional optical filters for discrimination of materials in NIR",
            "grade": "1.3",
            "entity": "Fraunhofer IOSB",
            "entity_group": "Visual Inspections Department",
            "entity_url": "https://www.iosb.fraunhofer.de/",
            "entity_image": "entity_images/fhg_logo.png",
            "place": "Karlsruhe, Germany",
            "start": "06/2012",
            "end": "09/2012",

            "background": [
                "In many industries, for example in food processing, automated optical measurement techniques ",
                "are used to ensure the quality of a product. Besides the visible part of the electromagnetic wave spectrum ",
                "also the near-infrared part between 800-2500nm is significant because many organic molecules are excited, which ",
                "in turn leads to an absorption or transmission of a certain wave length. With the help of these spectra, unwanted material ",
                "(for example dirt) can be differentiated from the wanted product. However, the high transportation speeds in the industry ",
                "prevent the usage of imaging spectrometers that have a maximum framerate of about 300Hz. For example, at a common transporation speed ",
                "of 3 meters per second only every centimeter of the transported goods would be analysed. This is too little for small materials ",
                "like coffee. Line cameras however can have high framerates of up to 20kHz, have a simple construction and are cheaper.",
                "A line camera, whose detector chips are based on Silicone, are sensitive to wave lengths from 200-1000nm. Common are cameras ",
                "that have several channels and therefore filters for a certain color (for example Red, Green and Blue). ",
                "Instead of using a convential, Gaussian shaped transmission spectrum optical filter, one could use non-conventional optical filters ",
                "with a different transmission spectrum. This transmission spectrum would be based on the material that is to be detected and can be constructed ",
                "using machine learning and classification procedures."
            ],
            "content": [
                "Construction and automation of an optical bench for gathering spectral data from different organic material",
                "Interfacing and automation of a NIR spectrometer for MATLAB analysis of the organic materials",
                "Interfacing and automation of a spectrally programmable NIR light source",
                "Classification of organic materials based on gathered data and using the NIR light source."
            ]
        },      
        {
            "type": "studies",
            "title": "Semester abroad",
            "title_studies": "Electrical & Telecommunication Engineering",
            "title_academic": "",
            "grade": "",
            "entity": "Universitatea Politehnica",
            "entity_group": "Faculty of Electronics and Telecommunications Engineering",
            "entity_url": "http://www.upt.ro/international/index.php?id=&lb=en",
            "entity_image": "entity_images/upt.jpg",
            "place": "Timisoara, Romania",
            "start": "2012",
            "end": "2013",
            "contents": [
                "Digital Signal Processing",
                "LabView Automation",
                "Wireless Communication"              
            ]
        },
        {
            "type": "studies",
            "title": "Bachelor studies",
            "title_studies": "Electrical Engineering",
            "title_academic": "Bachelor of Engineering (B.Eng.)",
            "grade": "1.9",
            "entity": "Hochschule Karlsruhe",
            "entity_group": "Faculty EIT",
            "entity_url": "https://www.hs-karlsruhe.de/en/prospective-students/regular-degree-programs/bachelor/",
            "entity_image": "entity_images/hska.png",
            "place": "Karlsruhe, Germany",
            "start": "2009",
            "end": "2013",
            "contents": [
                "Electrical Fields",
                "Control Theory",
                "Electronics",
                "Information Theory",
                "Stochastic Signals and Systems",
                "RF Techniques",
                "Design of Analogue and Digital Systems",
                "Mobile Communication Systems",
                "Measurement Techniques"
            ]
        }        
    ]
}
